docs-html/todo-items.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TODO Items and Task Management</title>
<meta name="author" content="Scimax VS Code Team" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/default.min.css" />
</head>
<body>
<main class="org-content">
<header id="title-block">
<h1 class="title">TODO Items and Task Management</h1>
<p class="author">Scimax VS Code Team</p>
<p class="date">2026-01-13</p>
</header>
<div id="org-todo-items" class="org-section org-level-1">
<h1>✅ TODO Items</h1>
<p>Scimax VS Code provides a comprehensive task management system built into your
documents. TODO items are headlines with a special keyword that indicates their
status.</p>

</div>
<div id="org-basic-todo-functionality" class="org-section org-level-1">
<h1>✅ Basic TODO Functionality</h1>
<div id="org-creating-todo-items" class="org-section org-level-2">
<h2>✅ Creating TODO Items</h2>
<p>Add TODO after the headline stars to create a task:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Write documentation
,** TODO Complete first draft
,** TODO Review and edit</code></pre>
</div>

</div>
<div id="org-cycling-todo-states" class="org-section org-level-2">
<h2>✅ Cycling TODO States</h2>
<p>Press Ctrl+C Ctrl+T on a headline to cycle through TODO states:</p>

<pre class="example">(no keyword) → TODO → DONE → (no keyword)</pre>

<p>Or use the command scimax.org.cycleTodo.</p>

<p>With speed commands enabled, press t at the beginning of a headline.</p>

</div>
<div id="org-todo-keywords" class="org-section org-level-2">
<h2>✅ TODO Keywords</h2>
<p>The default TODO keywords are:</p>

<table class="org-table">
<thead>
<tr><th>Keyword</th><th>Meaning</th></tr>
</thead>
<tbody>
<tr><td>TODO</td><td>Task that needs to be done</td></tr>
<tr><td>DONE</td><td>Completed task</td></tr>
</tbody>
</table>

<p>Additional states available:</p>

<table class="org-table">
<thead>
<tr><th>Keyword</th><th>Meaning</th></tr>
</thead>
<tbody>
<tr><td>NEXT</td><td>Next action to take</td></tr>
<tr><td>WAITING</td><td>Waiting for external input</td></tr>
<tr><td>HOLD</td><td>On hold / paused</td></tr>
<tr><td>CANCELLED</td><td>Task cancelled (won&#39;t be done)</td></tr>
</tbody>
</table>

</div>
<div id="org-logging-completion" class="org-section org-level-2">
<h2>⚠️ Logging Completion</h2>
<p>When you mark a task as DONE, a CLOSED timestamp is automatically added:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* DONE Write introduction
CLOSED: [2026-01-13 Mon 15:30]</code></pre>
</div>

</div>
</div>
<div id="org-priorities" class="org-section org-level-1">
<h1>✅ Priorities</h1>
<p>Priorities help you identify the most important tasks.</p>

<div id="org-setting-priorities" class="org-section org-level-2">
<h2>✅ Setting Priorities</h2>
<p>Add a priority cookie after the TODO keyword:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO [#A] Urgent and important task
,* TODO [#B] Important but not urgent
,* TODO [#C] Nice to have</code></pre>
</div>

</div>
<div id="org-priority-levels" class="org-section org-level-2">
<h2>✅ Priority Levels</h2>
<table class="org-table">
<thead>
<tr><th>Priority</th><th>Meaning</th></tr>
</thead>
<tbody>
<tr><td>[#A]</td><td>High priority - do first</td></tr>
<tr><td>[#B]</td><td>Medium priority - do soon</td></tr>
<tr><td>[#C]</td><td>Low priority - do when possible</td></tr>
</tbody>
</table>

</div>
<div id="org-priority-commands" class="org-section org-level-2">
<h2>✅ Priority Commands</h2>
<table class="org-table">
<thead>
<tr><th>Key/Command</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>Speed key 1</td><td>Set priority A</td></tr>
<tr><td>Speed key 2</td><td>Set priority B</td></tr>
<tr><td>Speed key 3</td><td>Set priority C</td></tr>
<tr><td>Speed key 0</td><td>Remove priority</td></tr>
<tr><td>Speed key ,</td><td>Increase priority (C→B→A)</td></tr>
</tbody>
</table>

<p>You can also set priority through the command palette:
scimax.org.setPriority</p>

</div>
</div>
<div id="org-progress-indicators" class="org-section org-level-1">
<h1>✅ Progress Indicators</h1>
<p>Track progress through subtasks using statistics cookies and checkboxes.</p>

<div id="org-statistics-cookies" class="org-section org-level-2">
<h2>✅ Statistics Cookies [/]</h2>
<div id="org-fraction-format" class="org-section org-level-3">
<h3>⚠️ Fraction Format</h3>
<p>Shows completed/total count:</p>

<div id="org-project-tasks-3-4" class="org-section org-level-4">
<h4>Project Tasks [3/4]</h4>
<div id="org-task-1" class="org-section org-level-5">
<h5>⚠️ Task 1</h5>
</div>
<div id="org-task-2" class="org-section org-level-5">
<h5>✅ Task 2</h5>
</div>
<div id="org-task-3" class="org-section org-level-5">
<h5>✅ Task 3</h5>
</div>
<div id="org-c-task-4" class="org-section org-level-5">
<h5>✅ [#C] Task 4</h5>
</div>
</div>
</div>
<div id="org-percentage-format" class="org-section org-level-3">
<h3>⚠️ Percentage Format</h3>
<p>Shows completion percentage:</p>

<div id="org-project-progress-25" class="org-section org-level-4">
<h4>Project Progress [25%]</h4>
<div id="org-design" class="org-section org-level-5">
<h5 class="org-done"><span class="org-todo org-done">DONE</span> Design</h5>
</div>
<div id="org-implementation" class="org-section org-level-5">
<h5 class="org-done"><span class="org-todo org-done">DONE</span> Implementation</h5>
</div>
<div id="org-testing" class="org-section org-level-5">
<h5>✅ Testing</h5>
</div>
<div id="org-deployment" class="org-section org-level-5">
<h5 class="org-todo"><span class="org-todo org-todo">TODO</span> Deployment</h5>
<p>Statistics cookies update automatically when child TODO states change.</p>

</div>
</div>
</div>
<div id="org-checkbox-lists" class="org-section org-level-3">
<h3>✅ Checkbox Lists</h3>
<p>For simpler task lists within a section, use checkboxes:</p>

</div>
</div>
</div>
<div id="org-shopping-list-2-4" class="org-section org-level-1">
<h1>Shopping List [2/4]</h1>
<ul>
<li><input type="checkbox" checked  disabled /> <p>Milk</p>
</li>
<li><input type="checkbox" checked  disabled /> <p>Bread</p>
</li>
<li><input type="checkbox"   disabled /> <p>Eggs</p>
</li>
<li><input type="checkbox" checked  disabled /> <p>Butter</p>
</li>
</ul>

<div id="org-checkbox-states" class="org-section org-level-3">
<h3>✅ Checkbox States</h3>
<table class="org-table">
<thead>
<tr><th>Syntax</th><th>State</th></tr>
</thead>
<tbody>
<tr><td>[ ]</td><td>Unchecked / not done</td></tr>
<tr><td>[X]</td><td>Checked / done</td></tr>
<tr><td>[-]</td><td>Partially complete (has mixed children)</td></tr>
</tbody>
</table>

</div>
<div id="org-toggling-checkboxes" class="org-section org-level-3">
<h3>✅ Toggling Checkboxes</h3>
<p>Press Ctrl+C Ctrl+C with cursor on a checkbox line to toggle it.</p>

<p>Or use scimax.org.toggleCheckbox.</p>

<div id="org-nested-checkboxes" class="org-section org-level-4">
<h4>✅ Nested Checkboxes</h4>
<p>Checkboxes can be nested. Parent checkboxes show aggregate state:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Packing List [1/2]
- [-] Clothes [2/3]
  - [X] Shirts
  - [X] Pants
  - [ ] Socks
- [X] Toiletries [3/3]
  - [X] Toothbrush
  - [X] Soap
  - [X] Towel</code></pre>
</div>

</div>
</div>
<div id="org-inserting-checkboxes" class="org-section org-level-3">
<h3>✅ Inserting Checkboxes</h3>
<table class="org-table">
<thead>
<tr><th>Command</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>scimax.org.insertCheckbox</td><td>Insert checkbox at cursor</td></tr>
</tbody>
</table>

<p>Type - [ ] followed by space to manually create a checkbox item.</p>

</div>
</div>
<div id="org-extended-todo-keywords" class="org-section org-level-1">
<h1>✅ Extended TODO Keywords</h1>
<p>Beyond TODO and DONE, use these states for workflow management:</p>

<div id="org-next" class="org-section org-level-2">
<h2>✅ NEXT</h2>
<p>Indicates the very next action to take:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* NEXT Call client about project requirements</code></pre>
</div>

<p>Use NEXT for tasks you&#39;re actively working on or will work on immediately.</p>

</div>
<div id="org-waiting" class="org-section org-level-2">
<h2>✅ WAITING</h2>
<p>Task is blocked waiting for someone or something:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* WAITING Review from manager
:PROPERTIES:
:WAITING_ON: John Smith
:END:</code></pre>
</div>

</div>
<div id="org-hold" class="org-section org-level-2">
<h2>✅ HOLD</h2>
<p>Task is paused but not cancelled:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* HOLD Website redesign
Paused until Q2 budget approval.</code></pre>
</div>

</div>
<div id="org-cancelled" class="org-section org-level-2">
<h2>✅ CANCELLED</h2>
<p>Task won&#39;t be done (but kept for records):</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* CANCELLED Old feature request
No longer relevant after product pivot.</code></pre>
</div>

</div>
<div id="org-workflow-example" class="org-section org-level-2">
<h2>✅ Workflow Example</h2>
<p>A typical task progression:</p>

<pre class="example">TODO → NEXT → WAITING → NEXT → DONE
         ↓
       HOLD → NEXT → DONE
         ↓
     CANCELLED</pre>

</div>
</div>
<div id="org-custom-todo-keywords" class="org-section org-level-1">
<h1>✅ Custom TODO Keywords</h1>
<p>You can define your own TODO workflow states for each file using the #+TODO:
keyword. This is useful for project-specific workflows like code review,
content publishing, or approval processes.</p>
