docs-html/todo-items.html

<div id="org-defining-custom-states" class="org-section org-level-2">
<h2>✅ Defining Custom States</h2>
<p>Add #+TODO: at the top of your org file (before any headings):</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: DRAFT REVIEW | PUBLISHED REJECTED</code></pre>
</div>

<p>The | separates active (incomplete) states from done (complete) states.
When you cycle TODO states, they will follow this sequence:</p>

<pre class="example">(none) → DRAFT → REVIEW → PUBLISHED → (none)</pre>

</div>
<div id="org-multiple-todo-lines" class="org-section org-level-2">
<h2>✅ Multiple TODO Lines</h2>
<p>You can define multiple workflow sequences:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: TODO IN-PROGRESS | DONE
,#+TODO: BUG INVESTIGATING FIXING | FIXED WONTFIX</code></pre>
</div>

<p>All states from all #+TODO: lines are recognized.</p>

</div>
<div id="org-without-pipe-separator" class="org-section org-level-2">
<h2>✅ Without Pipe Separator</h2>
<p>If you omit the |, the last state is treated as done:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: IDEA DRAFT REVIEW PUBLISHED</code></pre>
</div>

<p>This makes PUBLISHED the done state.</p>

</div>
<div id="org-syntax-variants" class="org-section org-level-2">
<h2>✅ Syntax Variants</h2>
<p>These keywords are all equivalent:</p>

<table class="org-table">
<thead>
<tr><th>Keyword</th><th>Usage</th></tr>
</thead>
<tbody>
<tr><td>#+TODO:</td><td>Standard TODO keyword definition</td></tr>
<tr><td>#+SEQ_TODO:</td><td>Sequential workflow (same as TODO)</td></tr>
<tr><td>#+TYP_TODO:</td><td>Type-based workflow</td></tr>
</tbody>
</table>

</div>
<div id="org-example-workflows" class="org-section org-level-2">
<h2>✅ Example Workflows</h2>
<div id="org-code-review-workflow" class="org-section org-level-3">
<h3>✅ Code Review Workflow</h3>
<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: DRAFT REVIEW APPROVED | MERGED REJECTED

,* DRAFT Implement new feature
,* REVIEW Fix login bug
,* APPROVED Update documentation</code></pre>
</div>

</div>
<div id="org-content-publishing-workflow" class="org-section org-level-3">
<h3>✅ Content Publishing Workflow</h3>
<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: IDEA OUTLINE WRITING EDITING | PUBLISHED ARCHIVED

,* WRITING Blog post about org-mode
,* EDITING Tutorial on source blocks</code></pre>
</div>

</div>
<div id="org-project-management-workflow" class="org-section org-level-3">
<h3>✅ Project Management Workflow</h3>
<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TODO: BACKLOG SPRINT IN-PROGRESS TESTING | DONE CANCELLED

,* IN-PROGRESS User authentication
,* TESTING Payment integration</code></pre>
</div>

</div>
</div>
</div>
<div id="org-logging-state-changes" class="org-section org-level-1">
<h1>✅ Logging State Changes</h1>
<p>Scimax VS Code can log when and how TODO states change.</p>

<div id="org-logbook-drawer" class="org-section org-level-2">
<h2>✅ LOGBOOK Drawer</h2>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<p>State changes are recorded in the LOGBOOK drawer:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* DONE Complete documentation
CLOSED: [2026-01-13 Mon 16:00]
:LOGBOOK:
- State &quot;DONE&quot;       from &quot;TODO&quot;       [2026-01-13 Mon 16:00]
- State &quot;TODO&quot;       from &quot;WAITING&quot;    [2026-01-12 Sun 10:00]
- State &quot;WAITING&quot;    from &quot;TODO&quot;       [2026-01-10 Fri 14:30]
:END:</code></pre>
</div>

</div>
<div id="org-timestamps-on-state-changes" class="org-section org-level-2">
<h2>✅ Timestamps on State Changes</h2>
<p>CLOSED: [2026-01-15 Thu 14:39]</p>

<p>When enabled, each state change adds:</p>

<ul>
<li><p>A timestamp showing when the change occurred</p>
</li>
<li><p>The previous state</p>
</li>
</ul>

<p>This creates a complete history of task progress.</p>

</div>
</div>
<div id="org-tags-for-todo-items" class="org-section org-level-1">
<h1>✅ Tags for TODO Items</h1>
<p>CLOSED: [2026-01-15 Thu 14:39]</p>

<p>Tags provide additional categorization beyond the headline hierarchy.</p>

<div id="org-adding-tags" class="org-section org-level-2">
<h2>✅ Adding Tags</h2>
<p>CLOSED: [2026-01-15 Thu 14:39]</p>

<p>Tags appear at the end of the headline, enclosed in colons:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Review quarterly report                               :work:urgent:
,* TODO Buy groceries                                         :personal:errands:</code></pre>
</div>

</div>
<div id="org-tag-commands" class="org-section org-level-2">
<h2>✅ Tag Commands</h2>
<p>CLOSED: [2026-01-15 Thu 14:39]</p>

<table class="org-table">
<thead>
<tr><th>Key/Command</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>Speed key Shift+;</td><td>Edit tags</td></tr>
<tr><td>scimax.org.setTags</td><td>Set tags via command</td></tr>
</tbody>
</table>

</div>
<div id="org-inherited-tags" class="org-section org-level-2">
<h2>✅ Inherited Tags</h2>
<p>CLOSED: [2026-01-15 Thu 14:39]</p>

<p>Child headlines inherit their parent&#39;s tags:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Work Projects                                              :work:
,** TODO Project A                                            :client1:
This task has both :work: and :client1: tags.
,** TODO Project B                                            :internal:
This task has both :work: and :internal: tags.</code></pre>
</div>

</div>
<div id="org-common-tag-conventions" class="org-section org-level-2">
<h2>✅ Common Tag Conventions</h2>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<table class="org-table">
<thead>
<tr><th>Tag</th><th>Usage</th></tr>
</thead>
<tbody>
<tr><td>@office</td><td>Context: at office</td></tr>
<tr><td>@home</td><td>Context: at home</td></tr>
<tr><td>@computer</td><td>Context: needs computer</td></tr>
<tr><td>@phone</td><td>Context: phone call</td></tr>
<tr><td>urgent</td><td>Priority indicator</td></tr>
<tr><td>project</td><td>Part of larger project</td></tr>
</tbody>
</table>

</div>
<div id="org-filtering-by-tags" class="org-section org-level-2">
<h2>✅ Filtering by Tags</h2>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<p>Use agenda views or search to filter tasks by tag:</p>

<ul>
<li><p>scimax.db.searchByTag - Search for specific tags</p>
</li>
<li><p>scimax.agenda.filterByTag - Filter agenda by tag</p>
</li>
</ul>

</div>
</div>
<div id="org-scheduling-and-deadlines" class="org-section org-level-1">
<h1>✅ Scheduling and Deadlines</h1>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<p>Assign dates to tasks for planning.</p>

<div id="org-scheduled" class="org-section org-level-2">
<h2>✅ SCHEDULED</h2>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<p>When you plan to start or work on a task:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Write report
SCHEDULED: &lt;2026-01-15 Wed&gt;</code></pre>
</div>

</div>
<div id="org-deadline" class="org-section org-level-2">
<h2>✅ DEADLINE</h2>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<p>When a task must be completed by:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Submit proposal
DEADLINE: &lt;2026-01-20 Mon&gt;</code></pre>
</div>

</div>
<div id="org-both-together" class="org-section org-level-2">
<h2>✅ Both Together</h2>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Complete project
SCHEDULED: &lt;2026-01-15 Wed&gt; DEADLINE: &lt;2026-01-25 Sat&gt;</code></pre>
</div>

</div>
<div id="org-adding-dates" class="org-section org-level-2">
<h2>✅ Adding Dates</h2>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<table class="org-table">
<thead>
<tr><th>Speed Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>s</td><td>Add/edit SCHEDULED date</td></tr>
<tr><td>d</td><td>Add/edit DEADLINE date</td></tr>
<tr><td>.</td><td>Insert timestamp</td></tr>
</tbody>
</table>

<p>Or use commands:</p>

<ul>
<li><p>scimax.org.schedule</p>
</li>
<li><p>scimax.org.deadline</p>
</li>
</ul>

<p>See <a href="timestamps.html">Timestamps</a> for more on date formats.</p>

</div>
</div>
<div id="org-time-tracking" class="org-section org-level-1">
<h1>✅ Time Tracking</h1>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>

<p>Track time spent on tasks using clock entries.</p>

<div id="org-clocking-in-out" class="org-section org-level-2">
<h2>✅ Clocking In/Out</h2>
<p>CLOSED: [2026-01-15 Thu 14:40]</p>


<table class="org-table">
<thead>
<tr><th>Speed Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>Shift+I</td><td>Clock in (start timing)</td></tr>
<tr><td>Shift+O</td><td>Clock out (stop timing)</td></tr>
</tbody>
</table>

</div>
<div id="org-clock-entries" class="org-section org-level-2">
<h2>✅ Clock Entries</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Clock entries are stored in the LOGBOOK drawer:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Working on documentation
:LOGBOOK:
CLOCK: [2026-01-13 Mon 09:00]--[2026-01-13 Mon 10:30] =&gt;  1:30
CLOCK: [2026-01-12 Sun 14:00]--[2026-01-12 Sun 16:00] =&gt;  2:00
:END:</code></pre>
</div>

</div>
<div id="org-total-time" class="org-section org-level-2">
<h2>✅ Total Time</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>The total clocked time appears in the properties or can be calculated for
reports.</p>

</div>
</div>
<div id="org-effort-estimates" class="org-section org-level-1">
<h1>✅ Effort Estimates</h1>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Estimate how long tasks will take.</p>
