docs-html/todo-items.html

<div id="org-setting-effort" class="org-section org-level-2">
<h2>✅ Setting Effort</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<!-- Unknown element type: property-drawer -->
<p>Add an EFFORT property:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO Review document
:PROPERTIES:
:EFFORT: 1:30
:END:</code></pre>
</div>

<table class="org-table">
<thead>
<tr><th>Speed Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>e</td><td>Set effort estimate</td></tr>
</tbody>
</table>

</div>
<div id="org-effort-format" class="org-section org-level-2">
<h2>✅ Effort Format</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Use H:MM format:</p>

<ul>
<li><p>0:30 - 30 minutes</p>
</li>
<li><p>1:00 - 1 hour</p>
</li>
<li><p>2:30 - 2 hours 30 minutes</p>
</li>
</ul>

</div>
</div>
<div id="org-agenda-integration" class="org-section org-level-1">
<h1>✅ Agenda Integration</h1>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>TODO items appear in agenda views for planning and review.</p>

<div id="org-viewing-all-todos" class="org-section org-level-2">
<h2>✅ Viewing All TODOs</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Use scimax.agenda.todoList or scimax.db.showTodos to see all tasks.</p>

</div>
<div id="org-deadline-view" class="org-section org-level-2">
<h2>✅ Deadline View</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Use scimax.agenda.deadlines to see upcoming and overdue deadlines.</p>

</div>
<div id="org-filtering-options" class="org-section org-level-2">
<h2>✅ Filtering Options</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<ul>
<li><p>By priority (A, B, C)</p>
</li>
<li><p>By tag</p>
</li>
<li><p>By date range</p>
</li>
<li><p>By TODO state</p>
</li>
</ul>

<p>See <a href="agenda.html">Agenda</a> for complete agenda documentation.</p>

</div>
</div>
<div id="org-best-practices" class="org-section org-level-1">
<h1>✅ Best Practices</h1>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<div id="org-task-granularity" class="org-section org-level-2">
<h2>✅ Task Granularity</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Make tasks actionable:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO &quot;Write documentation&quot;           ; Too vague
,* TODO Write introduction section      ; Better - specific and actionable</code></pre>
</div>

</div>
<div id="org-use-next-for-clarity" class="org-section org-level-2">
<h2>✅ Use NEXT for Clarity</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Always have at least one NEXT task to know what to work on:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Project: New Feature
,** DONE Design architecture
,** NEXT Implement core module           ; ← Clear next step
,** TODO Write tests
,** TODO Deploy to staging</code></pre>
</div>

</div>
<div id="org-regular-review" class="org-section org-level-2">
<h2>✅ Regular Review</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Periodically review tasks to:</p>

<ul>
<li><p>Move stale TODO items to HOLD or CANCELLED</p>
</li>
<li><p>Update WAITING items</p>
</li>
<li><p>Identify next actions</p>
</li>
</ul>

</div>
<div id="org-tags-vs-hierarchy" class="org-section org-level-2">
<h2>✅ Tags vs Hierarchy</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<p>Use hierarchy for project structure, tags for cross-cutting concerns:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Work                                                       :work:
,** Project A
,*** TODO Task requiring phone                                :@phone:
,*** TODO Task requiring computer                             :@computer:
,** Project B
,*** TODO Another phone task                                  :@phone:</code></pre>
</div>

<p>Now you can filter by @phone to see all phone tasks across projects.</p>

</div>
</div>
<div id="org-quick-reference" class="org-section org-level-1">
<h1>✅ Quick Reference</h1>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<div id="org-keybindings" class="org-section org-level-2">
<h2>✅ Keybindings</h2>
<p>CLOSED: [2026-01-15 Thu 14:41]</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>Ctrl+C Ctrl+T</td><td>Cycle TODO state</td></tr>
<tr><td>Ctrl+C Ctrl+C</td><td>Toggle checkbox</td></tr>
</tbody>
</table>

</div>
<div id="org-speed-commands-at-heading-start" class="org-section org-level-2">
<h2>✅ Speed Commands (at heading start)</h2>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>t</td><td>Cycle TODO state</td></tr>
<tr><td>1<em>2</em>3</td><td>Set priority A/B/C</td></tr>
<tr><td>0</td><td>Clear priority</td></tr>
<tr><td>,</td><td>Increase priority</td></tr>
<tr><td>s</td><td>Schedule</td></tr>
<tr><td>d</td><td>Deadline</td></tr>
<tr><td>e</td><td>Set effort</td></tr>
<tr><td>Shift+;</td><td>Set tags</td></tr>
<tr><td>Shift+I</td><td>Clock in</td></tr>
<tr><td>Shift+O</td><td>Clock out</td></tr>
</tbody>
</table>

</div>
<div id="org-commands" class="org-section org-level-2">
<h2>✅ Commands</h2>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<table class="org-table">
<thead>
<tr><th>Command</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>scimax.org.cycleTodo</td><td>Cycle TODO state</td></tr>
<tr><td>scimax.org.toggleCheckbox</td><td>Toggle checkbox</td></tr>
<tr><td>scimax.org.insertCheckbox</td><td>Insert checkbox</td></tr>
<tr><td>scimax.org.schedule</td><td>Add SCHEDULED timestamp</td></tr>
<tr><td>scimax.org.deadline</td><td>Add DEADLINE timestamp</td></tr>
<tr><td>scimax.db.showTodos</td><td>Show all TODO items</td></tr>
<tr><td>scimax.agenda.todoList</td><td>Open TODO agenda view</td></tr>
</tbody>
</table>

</div>
</div>
<div id="org-related-topics" class="org-section org-level-1">
<h1>✅ Related Topics</h1>
<p>CLOSED: [2026-01-15 Thu 14:42]</p>

<ul>
<li><p><a href="timestamps.html">Timestamps</a> - Date formats for scheduling and deadlines</p>
</li>
<li><p><a href="agenda.html">Agenda</a> - Viewing and filtering tasks</p>
</li>
<li><p><a href="document-structure.html">Document Structure</a> - Headlines and organization</p>
</li>
</ul>

</div>
<div id="org-navigation" class="org-section org-level-1">
<h1>Navigation</h1>
<ul>
<li><p>Previous: <a href="document-structure.html">Document Structure</a></p>
</li>
<li><p>Next: <a href="tables.html">Tables</a></p>
</li>
</ul>

</div>
</main>
</body>
</html>